Repository: mibuthu/wp-link-view
Catalog: src/languages/link-view-*.po
Languages: pt_pt

source: About %1$s
pt_pt: Sobre %1$s

source: General
pt_pt: Geral

source: Shortcode Attributes
pt_pt: Atributos do shortcode

source: Help and Instructions
pt_pt: Ajuda e instruções

source: Show links in posts or pages
pt_pt: Mostrar links em artigos ou páginas

source: To show links in a post or page the shortcode %1$s must be added in the post or page content text.
pt_pt: Para mostrar links num artigo ou página, o shortcode %1$s deve ser adicionado ao conteúdo do mesmo.

source: The listed links and their styles can be modified with the available attributes for the shortcode.
pt_pt: Os links apresentados e respectivos estilos podem ser modificados com os atributos disponíveis para o shortcode.

source: You can combine as many attributes as you want.
pt_pt: Pode combinar quantos atributos quiser.

source: E.g. the shortcode including the attributes %1$s and %2$s would look like this
pt_pt: Por exemplo, se o shortcode incluir os atributos %1$s e %2$s, teria o seguinte aspecto

source: Below you can find tables with all supported attributes, their descriptions and available options.
pt_pt: Abaixo pode encontrar tabelas com todos os atributos suportados com as respectivas descrições e opções disponíveis.

source: Show links in sidebars and widget areas
pt_pt: Mostrar links nas áreas das barras laterais e dos widgets

source: With the %1$s Widget you can add links in sidebars and widget areas.
pt_pt: Com o widget %1$s pode adicionar links nas áreas das barras laterais e dos widgets.

source: Goto %1$s and drag the %2$s-Widget into one of the sidebar or widget areas.
pt_pt: Vá para %1$s e arraste o widget %2$s-Widget para uma das áreas da barra lateral ou dos widgets.

source: Enter a title for the widget and add the required shortcode attributes in the appropriate field. All available shortcode attributes for the %1$s-shortcode can be used in the widget too.
pt_pt: Digite um título para o widget e adicione os atributos necessários do shortcode no campo apropriado. Todos os atributos disponíveis para o shortcode %1$s também podem ser usados no widget.

source: Press %1$s to confirm the changes.
pt_pt: Pressione %1$s para confirmar as mudanças.

source: %1$s Settings
pt_pt: %1$s configurações

source: In the %1$s settings page, available under %2$s, you can find some options to modify the plugin.
pt_pt: Na página de configurações %1$s, disponível em %2$s, pode encontrar algumas opções para modificar o plugin.

source: About the plugin author
pt_pt: Sobre o autor do plugin

source: This plugin is developed by %1$s, you can find more information about the plugin on the %2$s.
pt_pt: Este plugin foi desenvolvido por %1$s; pode encontrar mais informações sobre o plugin em %2$s.

source: WordPress plugin site
pt_pt: Site de plugins do WordPress

source: If you like the plugin please rate it on the %1$s.
pt_pt: Se gostou deste plugin, por favor, dê-lhe uma classificação positiva em %1$s.

source: WordPress plugin review site
pt_pt: Site de revisão de plugins do WordPress

source: If you want to support the plugin I would be happy to get a small donation
pt_pt: Se quiser apoiar o desenvolvimento deste plugin, eu ficaria feliz em receber um pequeno donativo

source: Donate with %1$s
pt_pt: Fazer donativo com %1$s

source: Translations
pt_pt: Traduções

source: Please help translating this plugin into your language.
pt_pt: Por favor, ajude a traduzir este plugin na sua língua.

source: You can submit your translations at %1$s.
pt_pt: Pode enviar suas traduções em %1$s.

source: There the source strings will be kept in sync with the actual development version. And in each plugin release the available translation files will be updated.
pt_pt: As cadeias de caracteres de origem serão mantidas em sincronia com a versão de desenvolvimento actual. E em cada versão nova do plugin, os arquivos de tradução disponíveis serão actualizados.

source: In the following tables you can find all available shortcode attributes for %1$s
pt_pt: Nas tabelas que se seguem, pode encontrar todos os atributos disponíveis para o shortcode %1$s

source: Link List
pt_pt: Lista de links

source: Link Slider
pt_pt: Slider de links

source: Multi-column layout types and options
pt_pt: Tipos e opções do layout de várias colunas

source: There are 3 different types of multiple column layouts for category or link-lists available. Each type has some advantages but also some disadvantages compared to the others.
pt_pt: Existem 3 tipos diferentes de layouts de várias colunas para categorias ou listas de links. Cada tipo tem algumas vantagens, mas também algumas desvantagens em relação aos outros.

source: Additionally the available layouts can be modified with their options
pt_pt: Além disso, os layouts disponíveis podem ser modificados com as respectivas opções

source: layout type
pt_pt: tipo de layout

source: type description
pt_pt: descrição do tipo

source: Number
pt_pt: Número

source: Use a single number to specify a static number of columns.
pt_pt: Introduza um único dígito para especificar o número estático de colunas.

source: This is a short form of the static layout type (see below).
pt_pt: Esta é uma forma curta do tipo de layout estático (veja abaixo).

source: Set a static number of columns. The categories or links will be arranged in rows.
pt_pt: Defina um número estático de colunas. As categorias ou links serão organizados em linhas.

source: available options
pt_pt: opções disponíveis

source: Provide a single number which specifys the number of columns. If no value is given 3 columns will be displayed by default.
pt_pt: Introduza o número de colunas (apenas um dígito). Se não for introduzido nenhum valor, serão exibidas, por omissão, 3 colunas.

source: This type uses the %1$s to arrange the columns.
pt_pt: Este tipo usa o %1$s para organizar as colunas.

source: multi-column feature of CSS
pt_pt: funcionalidade multi-coluna do CSS

source: You can use all available properties for CSS3 Multi-column Layout (see %1$s for detailed information).
pt_pt: Pode usar todas as propriedades disponíveis para layout multi-coluna CSS3 (consulte %1$s para obter informações detalhadas).

source: this link
pt_pt: este link

source: The given attributes will be added to the wrapper div element. Also the prefixed browser specific attributes will be added.
pt_pt: Os atributos indicados serão adicionados ao elemento div envolvente. Além disso, serão adicionados os atributos prefixados específicos do navegador .

source: %1$s grid layout JavaScript library
pt_pt: %1$s biblioteca JavaScript de layout de grelha

source: You can use all options which are available for the Masonry library (see %1$s for detailed information).
pt_pt: Pode usar todas as opções disponíveis para a biblioteca do layout tipo tijolos (veja %1$s para obter informações detalhadas).

source: The given options will be forwarded to the JavaScript library.
pt_pt: As opções dadas serão encaminhadas para a biblioteca JavaScript.

source: Usage
pt_pt: Utilização

source: For the most types and options it is recommended to define a fixed width for the categories and/or links. This width must be set manually e.g. via the css entry:
pt_pt: Para a maioria dos tipos e opções é recomendado definir uma largura fixa para as categorias e/ou links. Esta largura deve ser definida manualmente, por exemplo, através do seguinte código CSS:

source: Depending on the type and options there are probably more css modifications required for a correct multi-column layout.
pt_pt: Dependendo do tipo e das opções, provavelmente será necessário fazer mais modificações ao CSS para obter um layout correcto com várias colunas.

source: There are several ways to add the required css code. One method is the %1$s setting %2$s which can be found in %3$s.
pt_pt: Existem várias maneiras de adicionar o código CSS necessário. Um método é a opção de configuração %1$s %2$s que pode ser encontrada em %3$s.

source: CSS-code for %1$s
pt_pt: Código CSS para %1$s

source: The optional type options must be added in brackets in the format "option_name=value", multiple options can be added separated by a pipe %1$s.
pt_pt: As opções opcionais de tipo têm de ser adicionadas entre parênteses rectos com o formato «option_name=valor»; podem ser adicionadas múltiplas opções separadas pelo símbolo %1$s (Shift-\\).

source: Examples
pt_pt: Exemplos

source: show the categories in 3 static columns
pt_pt: mostrar as categorias em 3 colunas estáticas

source: show the link-lists in 2 static columns
pt_pt: mostrar as listas de links em 2 colunas estáticas

source: show the categories in columns with the css column properties with a fixed width per category
pt_pt: mostrar as categorias em colunas com as propriedades CSS da coluna com largura fixa por categoria

source: show the link-lists in 4 columns by using the CSS multi column properties
pt_pt: mostrar as listas de links em 4 colunas usando as propriedades CSS de coluna múltipla

source: show the categories in columns by using the masonry script (with some specific masonry options)
pt_pt: mostrar as categorias em colunas usando o script de layout tipo tijolos (com algumas opções específicas)

source: Attribute name
pt_pt: Nome do atributo

source: Value options
pt_pt: Opções do valor

source: Default value
pt_pt: Valor por omissão

source: Description
pt_pt: Descrição

source: Required capabilities to show the %1$s page
pt_pt: Capacidades necessárias para mostrar a página %1$s

source: About
pt_pt: Sobre

source: Default
pt_pt: Por omissão

source: With this option you can specify the required capabilities to show the %1$s page.
pt_pt: Com esta opção pode especificar as capacidades necessárias para mostrar a página %1$s.

source: More information can be found in the %1$s.
pt_pt: Mais informações podem ser encontradas em %1$s.

source: Required role to manage links
pt_pt: Papel necessário para gerir links

source: With this option minimum required role to manage links can be set
pt_pt: Com esta opção, pode-se definir qual o papel mínimo necessário para gerir links

source: Capability
pt_pt: Capacidade

source: Please note that this option also affects the access to the %1$s page if the required capabilities are set to %2$s.
pt_pt: Note que esta opção também afecta o acesso à página %1$s se as capacidades necessárias forem definidas como %2$s.

source: Custom CSS classes for %1$s
pt_pt: Classes de CSS personalizadas para %1$s

source: With this option you can specify custom CSS classes which will be added to the wrapper div of the %1$s shortcode.
pt_pt: Com esta opção pode especificar classes CSS personalizadas que serão adicionadas ao div do shortcode %1$s.

source: Use the %1$s to seperate multiple classes.
pt_pt: Use %1$s para separar várias classes.

source: Custom CSS for %1$s
pt_pt: CSS personalizado para %1$s

source: With this option you can specify custom CSS for the links displayed by the %1$s shortcode.
pt_pt: Com esta opção, pode personalizar o CSS para os links exibidos pelo shortcode %1$s.

source: There are a lot of CSS classes available which are automatically added by the %1$s shortcode
pt_pt: Existem muitas classes CSS disponíveis que são automaticamente adicionadas pelo shortcode %1$s

source: e.g.
pt_pt: por ex.

source: All available classes can be found in the sourcecode of a post or page where the shortcode is included.
pt_pt: Todas as classes disponíveis podem ser encontradas no código-fonte de um artigo ou página onde o shortcode tenha sido incluído.

source: To differ between different shortcodes you can set the attribute %1$s and add CSS-code for these special classes
pt_pt: Para diferenciar entre as várias instâncias de shortcodes, pode definir o atributo %1$s e adicionar código CSS para essas classes especiais

source: This attribute specifies how the links are displayed.
pt_pt: Este atributo especifica como os links são exibidos.

source: Showing the links in a list is the default, alternatively the links can be displayed in a slider.
pt_pt: Por omissão, são mostrados os links numa lista; alternativamente, os links podem ser exibidos num slider.

source: category slugs
pt_pt: slugs de categoria

source: This attribute specifies the displayed link categories. Default is an empty string to show all categories.
pt_pt: Este atributo especifica as categorias de link exibidos. Por omissão, é uma sequência vazia, o que mostra todas as categorias.

source: Links with categories that doesn´t match the filter will not be displayed.
pt_pt: Links com categorias que não correspondem ao filtro não serão exibidos.

source: The filter is specified via the given category slug. The simplest version is a single slug to only show links from this category.
pt_pt: O filtro é especificado através do slug da categoria. A versão mais simples é um único slug para mostrar apenas os links dessa categoria.

source: To show multiple categories, multiple slugs can be provided separated by %1$s or %2$s.
pt_pt: Para mostrar várias categorias, podem ser indicados diferentes slugs, separados por %1$s ou %2$s.

source: Show all links with category %1$s.
pt_pt: Mostrar todos os links com a categoria %1$s.

source: Show all links with category %1$s or %2$s.
pt_pt: Mostrar todos os links com a categoria %1$s ou %2$s.

source: This attribute specifies which categories should be excluded.
pt_pt: Este atributo especifica quais as categorias que devem ser excluídas.

source: This attribute is only considered if the attribute %1$s is not set.
pt_pt: Esse atributo só é considerado se o atributo %1$s não estiver definido.

source: If the category name has spaces, the name must be surrounded by quotes.
pt_pt: Se o nome da categoria tiver espaços, o nome deve ser colocado entre aspas.

source: To exclude multiple categories, multiple names can be provided separated by %1$s.
pt_pt: Para excluir várias categorias, podem ser escolhidos vários nomes, separados por %1$s.

source: Example
pt_pt: Exemplo

source: By default the links are grouped by category.
pt_pt: Por omissão, os links são agrupados por categoria.

source: To show all links in one list this option can be disabled.
pt_pt: Para mostrar todos os links numa lista, esta opção pode ser desactivada.

source: This attribute specifies if the category name is shown as a headline if category grouping is enabled.
pt_pt: Este atributo especifica se o nome da categoria é mostrado como um título quando activado o agrupamento da categoria.

source: If enabled the number of links is displayed in brackets next to the category name in the headline.
pt_pt: Se activado, o número de links será exibido no título, entre parênteses rectos a seguir ao nome da categoria.

source: The shortcode options %1$s and %2$s must be enabled to display the number.
pt_pt: As opções de shortcode %1$s e %2$s devem ser activadas para mostrar o número.

source: This attribute specifies the sort parameter of the links for each category.
pt_pt: Este atributo especifica o parâmetro de ordenação dos links para cada categoria.

source: By default the links are sorted according the link name.
pt_pt: Por omissão, os links são classificados de acordo com o nome do link.

source: A random order can be specify by %1$s.
pt_pt: Pode-se especificar uma ordenação aleatória com %1$s.

source: A detailed description of all available options is available in the %1$sWordPress codex%2$s.
pt_pt: Uma descrição detalhada de todas as opções disponíveis está disponível no %1$sWordPress codex%2$s.

source: See also the attribute %1$s to specify the order direction.
pt_pt: Veja também o atributo %1$s para especificar a direcção da ordenação.

source: This attribute sets the order direction for the %1$s attribute.
pt_pt: Este atributo define a ordenação do atributo %1$s.

source: The available options are %1$s (default) and %2$s.
pt_pt: As opções disponíveis são %1$s (por omissão) e %2$s.

source: This attribute sets the number of displayed links for each category.
pt_pt: Este atributo define o número de links exibidos para cada categoria.

source: A number smaller than 0 displays all links.
pt_pt: Um número menor que 0 exibe todos os links.

source: This attribute specifies if the image shall be displayed instead of the name.
pt_pt: Este atributo especifica se a imagem deve ser exibida em vez do nome.

source: This attribute is only considered for links where an image is set.
pt_pt: Este atributo é apenas tido em conta nos links em que seja definida uma imagem.

source: With this attribute more complex display options can be defined.
pt_pt: Com este atributo podem ser definidas opções de exibição mais complexas.

source: By default (empty string) only the link name or the link image (see attribute %1$s) is shown.
pt_pt: Por omissão (sequência vazia) apenasé mostrado o nome do link ou a imagem do link (ver atributo %1$s).

source: By specifying the below described JSON structure complex display options can be defined.
pt_pt: Ao especificar as opções abaixo descritas da estrutura JSON, podem ser definidas opções complexas de exibição.

source: Please use single quotes for defining this attribute because the double quotes are required to define the JSON code.
pt_pt: Por favor, use plicas para definir este atributo porque as aspas são necessárias para definir o código JSON.

source: This attribute can also be defined as the content of an enclosed shortcode e.g. %1$s.
pt_pt: Este atributo também pode ser definido como o conteúdo de um shortcode, como, por exemplo, %1$s.

source: JSON data
pt_pt: Dados JSON

source: Examples with all possible options
pt_pt: Exemplos com todas as opções possíveis

source: Defining a list of JSON Objects (%1$s pairs) is the simplest version of usage.
pt_pt: A forma mais simples de utilização é definir uma lista de objectos JSON (%1$s pares).

source: The key defines one of the available items (see "%1$s"), the value defines an optional heading for the item.
pt_pt: A chave define um dos itens disponíveis (ver «%1$s»), o valor define uma posição opcional para o item.

source: If no heading is required leave the value empty (%1$s).
pt_pt: Se não for necessário nenhum título, deixe o valor vazio (%1$s).

source: The list must be enclosed in curly braces (%1$s) to have valid JSON data. Double quotes must be added around the key and the value.
pt_pt: A lista deve ser rodeada de chavetas (%1$s) para os dados JSON serem válidos. Devem ser adicionadas aspas em torno da chave e do valor.

source: The %1$s character separates the key and the value, multiple objects are separated via comma (%2$s).
pt_pt: O carácter %1$s separa a chave do valor; vários objectos são separados por uma vírgula (%2$s).

source: Add a %1$s at the end of the item name to include a link to the link target.
pt_pt: Adicione um %1$s no final do nome do item para incluir um link para o destino do link.

source: Multiple items can be grouped by using sub-object. The key of the sub-object defines the name of the group which also will be added as a css-class (e.g. %1$s).
pt_pt: Vários itens podem ser agrupados usando um sub-objecto. A chave do sub-objecto define o nome do grupo que também será adicionado como uma classe CSS (por exemplo, %1$s).

source: With this attribute the display option for link images can be set, if no link image is available.
pt_pt: Com este atributo, a opção de exibição de imagens de link pode ser definida, se nenhuma imagem de link estiver disponível.

source: This option is only considered if the %1$s item is used in %2$s.
pt_pt: Esta opção só é considerada se o item %1$s for usado em %2$s.

source: With %1$s an %2$s tag is still added.
pt_pt: Com %1$s ainda será adicionada a etiqueta %2$s.

source: Due to the empty link address of the image the %1$s attribute will be displayed.
pt_pt: Como o endereço de link da imagem não foi preenchido, será exibido o atributo %1$s.

source: With %1$s the complete link item will be removed.
pt_pt: Com %1$s será removido o item completo do link.

source: With the other options only the %1$s tag will be removed and an alternative text (link name or description) will be displayed.
pt_pt: Com as outras opções, apenas a etiqueta %1$s será removida e um texto alternativo (nome do link ou descrição) será exibido.

source: Set one of the available options to override the default value defined for the link.
pt_pt: Escolha uma das opções disponíveis para substituir o valor por omissão definido para o link.

source: With this attribute the %1$s attribute for the HTML-links can be set.
pt_pt: Com este atributo pode-se definir o atributo %1$s para os links HTML.

source: see %1$sthis link%2$s for details
pt_pt: consulte %1$seste este link%2$s para obter detalhes

source: With this attribute additional CSS classes can be specified. The classes are added to the link-view wrapper div.
pt_pt: Com este atributo, podem ser especificadas classes adicionais de CSS. As classes são adicionadas ao div do link-view.

source: With this attribute a css class suffix can be specified. This allows using different css styles for different link lists or sliders on the same site.
pt_pt: Com este atributo pode ser especificado um sufixo de classe CSS. Isso permite utilizar diferentes estilos CSS para diferentes listas de links ou sliders no mesmo site.

source: This attribute specifies the vertical alignment of the links. Changing this attribute normally only make sense if the link-images are displayed.
pt_pt: Este atributo especifica o alinhamento vertical dos links. Normalmente só faz sentido alterar este atributo se as imagens do link forem exibidas.

source: With this option e.g. the vertical alignment of the list symbol relatively to the image or the vertical alignment of images with different height in a slider can be changed.
pt_pt: Com esta opção podem ser alterados, por exemplo, o alinhamento vertical do símbolo da lista relativamente à imagem ou ao alinhamento vertical de imagens com diferentes alturas num slider.

source: This attribute sets the style type of the list symbol.
pt_pt: Este atributo define o tipo de estilo do símbolo da lista.

source: With the default value %1$s the standard type which is set in your theme will be used.
pt_pt: Com o valor por omissão %1$s, será usado o tipo padrão definido pelo seu tema.

source: All other available options overide this standard.
pt_pt: Todas as outras opções disponíveis sobrepõe-se a este padrão.

source: For example setting the value to %1$s will hide the list symbols.
pt_pt: Por exemplo, definindo o valor como %1$s ocultará os símbolos da lista.

source: This attribute specifies column layout for the categories in list view.
pt_pt: Este atributo especifica o layout da coluna para as categorias no modo de exibição «lista».

source: There are 3 different types of multiple column layouts available.
pt_pt: Estão disponíveis 3 tipos diferentes de layouts, cada qual com um número diferente de colunas.

source: Find more information regarding the types and options in the chapter %1$s.
pt_pt: Encontre mais informações sobre os tipos e opções no capítulo %1$s.

source: This attribute specifies column layout for the links in list view.
pt_pt: Este atributo especifica o layout da coluna para os links no modo de exibição «lista».

source: This attribute sets the fix width of the slider.
pt_pt: Este atributo define a largura fixa do slider.

source: If the attribute is set to %1$s the width will be calculated automatically due to the given image sizes.
pt_pt: Se o atributo for definido como %1$s a largura será calculada automaticamente de acordo com o tamanho da imagem.

source: This attribute is only considered if the view type %1$s is selected.
pt_pt: Este atributo só é considerado se o tipo de exibição %1$s for seleccionado.

source: This attribute sets the fix height of the slider.
pt_pt: Este atributo define a altura fixa do slider.
