Repository: mibuthu/wp-link-view
Catalog: src/languages/link-view-*.po
Languages: pt_pt

source: If the attribute is set to %1$s the height will be calculated automatically due to the given image sizes.
pt_pt: Se o atributo for definido como %1$s, a altura será calculada automaticamente de acordo com o tamanho da imagem.

source: This attribute sets the duration between the the slides in milliseconds.
pt_pt: Este atributo define a duração entre os slides em milisegundos.

source: The link stands still for this time and afterwards the sliding animation to the next link starts.
pt_pt: A animação do link fica parada durante este tempo e depois começa a animação deslizante para o próximo link.

source: This attribute sets the duration of the animation for switching from one link to the next in milliseconds.
pt_pt: Este atributo define a duração, em milisegundos, da animação para alternar de um link para o próximo.

source: Title
pt_pt: Título

source: This option defines the displayed title for the widget.
pt_pt: Esta opção define o título que é mostrado para o widget.

source: Shortcode attributes
pt_pt: Atributos do shortcode

source: All attributes which are available for the %1$s shortcode can be used.
pt_pt: Podem ser usados todos os atributos disponíveis para o shortcode %1$s.

source: With this widget a %1$s shortcode can be added to a sidebar or widget area.
pt_pt: Com este widget é possível adicionar um shortcode %1$s a uma barra lateral ou área de widgets.
